{
    "projects": [
        {
            "id": 0,
            "name": "FCS CRM",
            "roles": [
                "UI/UX Designer",
                "PO/PM"
            ],
            "outils": [
                "Figma",
                "Adobe XD",
                "Miro",
                "Notion"
            ],
            "duree": "12 mois",
            "description": "C'est une multinationale qui a décidé d’améliorer leurs ventes en proposant un CRM à leurs commerciaux afin d'obtenir un meilleur rendement. Ce projet comporte de la big Data. Il s’agit de mon tout premier projet professionnel en tant que Designeur UI/UX.",
            "img" : "src/images/CRM-thumbnail.jpg",
            "categories" : {
                "enjeux" : [{
                    "description" : "L’enjeu principal était de pouvoir avoir un design qui pourrait s’adapter à tout type d’environnement, Étant donné que c’était une application internationale, un mauvais design pourrait impacter l’efficacité et engendrer la frustration de milliers de personnes.",
                    "img" : ["../src/images/crm/crm-enjeux.svg"]
                },
                {
                    "description" : "Le Groupe FCS est assez large et possède beaucoup de compétiteurs comme : Altech、Freesia Macross、Hosokawa Micron、KAWATA MFG. CO.,LTD.、Nissei ASB Machine etc.. Je peux alors dire que le marché est assez vaste et qu’il va falloir avoir une application efficace, plus que jolie, autrement dit favoriser l’UX à l’UI, vu qu’il s’agit d’une apllication utilisée entièrement en interne, pour que les clients puissent être plus rentable tous les jours.",
                    "img": "../src/images/crm/crm_enjeux2.svg"
                },
                {
                    "swot" : [
                    {
                        "name" : "Strengths",
                        "list" : ["a",
                                "b",
                                "c"]
                    },
                    {
                        "name" : "Weaknesses",
                        "list" : ["a",
                                "b",
                                "c"]
                    },
                    {
                        "name" : "Opportunities",
                        "list" : ["a",
                                "b",
                                "c"]
                    },
                    {
                        "name" : "Threats",
                        "list" : ["a",
                                "b",
                                "c232323"]
                    }]
                }],
                "debut" : [{
                    "description":"Je n’ai pas dû faire de personas, userflow ou quelconque autre recherche car les développeurs et le client attendaient et j’étais seul sur le projet, néanmoins j’ai décidé d’en créer juste pour ce portfolio pour vous montrer que je suis capable d’en faire. "
                },
                {
                    "description" : "J’ai créé deux UX personas, deux types de commercial différents qui pourrait travailler chez FCS et qui donc utiliserait notre application. Avec le recul je pense que j’aurais dû en créer malgrès mon manque de temps."
                },
                {
                    "personas" : [{
                        "img" : "",
                        "name" : "Wang, Chi-Hsu",
                        "age" : "57 ans",
                        "localisation": "Taichung, Taiwan",
                        "quote" : "‘‘Je n’aime pas la technologie car elle me ralentit. Si je peux l’éviter je le ferais car je suis plus efficace seul’’",
                        "description" : "Wang est commercial chez FCS depuis 25ans, il a de l’expérience et connait l’entreprise comme sa poche. Il est proche de la retraite et veux simplement finir ses années dans de bonnes conditions sans prise de tête. ",
                        "comportements" : ["Il a beaucoup de confiance en soi, il n’a plus rien à prouver", "Il est très bon socialement et a beaucoup de contacts"],
                        "objectifs" : ["Conclure des contrats sans difficulté", "Entretenir une bonne relation avec ses clients"],
                        "Points faibles" : ["Il a débuter sa carrière sans utiliser la technologie. Il la déteste car il ne sait pas l’utiliser et donc il pense que c’est une perte de temps."],
                        "motivations" : ["Sérénité", "Reconnaissance", "Expertise"]
                    },
                    {
                        "img" : "",
                        "name" : "Chang, Yong-Xi",
                        "age" : "27 ans",
                        "localisation": "Taichung, Taiwan",
                        "quote" : "‘‘Mon objectif ne sera jamais atteint car je vise toujours beaucoup trop haut.’’",
                        "description" : "Change commence tout juste sa carrière et à la soif de réussir. Il a donc rejoint FCS en tant que commercial pour pouvoir leur démontrer ses talents de vendeur. Il a un seul but, il veut tout faire pour être le meilleur dans son travail afin d’avoir une reconnaissance et de monter en grade le plus rapidement possible.",
                        "comportements" : ["Il a beaucoup trop de confiance en soi, il a donc beaucoup d’ennemis.", "Il travaille très dur et son travail porte souvent ses fruits."],
                        "objectifs" : ["Monter en grade rapidement", "Vendre le plus possible, le plus rapidement possible"],
                        "Points faibles" : ["Il n’a pas énormément d’expérience, ce qui veut dire que sa personnalité peut lui jouer des tours et l’empêcher de conclure des ventes car il est trop arrogant."],
                        "motivations" : ["Succès", "Reconnaissance", "Argent"]
                    }]
                },
                {
                    "description" : "Le user flow est une partie très importante pour préparer un projet. Voici celui que j’ai designé pour la fonctionnalité de “pointage/dépointage” de ce projet, uniquement pour ce portfolio.",
                    "img" : "../src/images/crm/crm-taskflow.svg"
                },
                {
                    "description" : "Le Wireframing de ce projet à été secoué beaucoup de fois par changements fréquents d’orientation. Néanmoins, en suivant les changements demandés par l’équipe, j’ai réussi à produire un wireframing qui correspondait à l’attente de mon supérieur pour en faire une démonstration au client.",
                    "wireframes" : [{
                        "img": ["../src/images/crm/crm-wr1.jpg"],
                        "description" : "Première version du flow pour accéder a plannifier une visite."
                    },
                    {
                        "img" : ["../src/images/crm/crm-wr2.jpg"],
                        "description" : "Première version du flow pour voir la liste des clients. (non complète)"
                    },
                    {
                        "img" : ["../src/images/crm/crm-wr3.jpg","../src/images/crm/crm-wr4.jpg","../src/images/crm/crm-wr5.jpg","../src/images/crm/crm-wr6.jpg"],
                        "description" : "Idées de flow pour la fonctionnalité “Punch in/out”."
                    }]
                }],
                "designUI" : [{}],
                "problemes" : [{}],
                "conclusion" : [{}]
            }
        },
        {
            "id": 1,
            "name": "FCS IMF-Go Lite",
            "roles": [
                "UI/UX Designer",
                "PO/PM"
            ],
            "outils": [
                "Figma",
                "Notion"
            ],
            "duree": "4 mois",
            "description": "IMF-GO Lite est un project qui permet aux acheteurs de machines FCS de pouvoir suivre des commandes plus ou moins compliqués avec tout un tas de statistiques",
            "img" : "src/images/CRM-Lite-thumbnail.jpg"
        },
        {
            "id": 2,
            "name": "Brilltek - BrillPunch",
            "roles": [
                "UI/UX Designer"
            ],
            "outils": [
                "Figma",
                "Notion"
            ],
            "duree": "Projet abandonné",
            "description": "Système de pointage avancé pour des employeurs ou des freelances. Le but est de pouvoir convenir à tout type d'emploi du temps en ayant un design très modulable.",
            "img" : "src/images/Brillpunch-thumbnail.jpg"
        }
    ]
}